$(document).ready(function () {
  let location = window.location.href;
  let directoryPath = location.substring(0, location.lastIndexOf("/") + 1);

  function percentage(partialValue, totalValue) {
    return (100 * partialValue) / totalValue;
  }

  function formatDateString(day, month, year) {
    month = parseInt(month) + 1; // We add one because the value of xml starts of 0. For example January is in zero position.
    const d = new Date(`${year}-${month}-${day}`);
    const years = d.getFullYear();
    const date = d.getDate();
    const months = d.getMonth() + 1;
    const formattedDate = `${date}/${months}/${years}`;
    return formattedDate;
  }

  function dateFormat(date) {
    const initial = date.split(/\//);
    return [initial[1], initial[0], initial[2]].join("/"); //=> 'mm/dd/yyyy'
  }

  function isAfter(date1, date2) {
    return date1 > date2;
  }

  function fadeOutElement(el) {
    el.style.opacity = 1;
    (function fade() {
      if ((el.style.opacity -= 0.1) < 0) {
        el.style.display = "none";
      } else {
        setTimeout(requestAnimationFrame(fade), 100);
      }
    })();
  }

  function fadeInElement(el, display) {
    el.style.opacity = 0;
    el.style.display = display || "block";
    (function fade() {
      var val = parseFloat(el.style.opacity);
      if (!((val += 0.1) > 1)) {
        el.style.opacity = val;
        setTimeout(requestAnimationFrame(fade), 100);
      }
    })();
  }

  function maxElement(array) {
    //https://stackoverflow.com/questions/1053843/get-the-element-with-the-highest-occurrence-in-an-array
    if (array.length == 0) return null;
    var modeMap = {};
    var maxEl = array[0],
      maxCount = 1;
    for (var i = 0; i < array.length; i++) {
      var el = array[i];
      if (modeMap[el] == null) modeMap[el] = 1;
      else modeMap[el]++;
      if (modeMap[el] > maxCount) {
        maxEl = el;
        maxCount = modeMap[el];
      }
    }
    return maxEl;
  }

  function countItemsInArray(array, item) {
    let count = 0;

    array.forEach((element) => {
      if (element === item) {
        count += 1;
      }
    });
    return count;
  }

  function dateToTimestamp(date) {
    date = date.split("/");
    let newDate = new Date(date[2], date[1] - 1, date[0]);
    newDate = newDate.getTime();
    return newDate;
  }

  function findDifferenceOfDays(end, start) {
    const endTimestamp = dateToTimestamp(end);
    const startTimestamp = dateToTimestamp(start);
    let difDaysTS = endTimestamp - startTimestamp;
    let diffDays = difDaysTS / (1000 * 3600 * 24);
    diffDays = parseInt(diffDays);
    diffDays = Math.abs(diffDays);
    return diffDays;
  }

  function todayDate() {
    let today = new Date();
    const dd = String(today.getDate()).padStart(2, "0");
    const mm = String(today.getMonth() + 1).padStart(2, "0"); //January is 0!
    const yyyy = today.getFullYear();
    today = dd + "/" + mm + "/" + yyyy;
    return today;
  }

  function fixMonth(month) {
    let returnValue;
    returnValue = parseInt(month);
    returnValue++;
    return returnValue;
  }

  function toDatatables(input) {
    $(input).DataTable({
      pagingType: "numbers",
      pageLength: 5,
      paging: true,
      language: {
        url: "https://cdn.datatables.net/plug-ins/1.11.2/i18n/el.json",
      },
    });
  }

  //https://stackoverflow.com/questions/1960473/get-all-unique-values-in-a-javascript-array-remove-duplicates
  function onlyUnique(value, index, self) {
    return self.indexOf(value) === index;
  }

  function uniqueByKey(array, key) {
    return [...new Map(array.map((x) => [x[key], x])).values()];
  }

  function randomColor() {
    return "#" + Math.floor(Math.random() * 16777215).toString(16);
  }

  function pieChart(idDiv, counter, name, array) {
    var chart = am4core.create(idDiv, am4charts.PieChart);

    // Add data
    chart.data = array;

    // Add and configure Series
    var pieSeries = chart.series.push(new am4charts.PieSeries());
    pieSeries.dataFields.value = counter;
    pieSeries.dataFields.category = name;
    pieSeries.slices.template.propertyFields.fill = "color";
  }
  const getMonths = (fromDate, toDate) => {
    const fromYear = fromDate.getFullYear();
    const fromMonth = fromDate.getMonth();
    const toYear = toDate.getFullYear();
    const toMonth = toDate.getMonth();
    const months = [];

    for (let year = fromYear; year <= toYear; year++) {
      let monthNum = year === fromYear ? fromMonth : 0;
      const monthLimit = year === toYear ? toMonth : 11;

      for (; monthNum <= monthLimit; monthNum++) {
        let month = monthNum + 1;
        months.push({ year, month });
      }
    }
    return months;
  };

  const seaVathmoi = [
    "Ψάρακας",
    "Ναύτης",
    "Ναύτης ΕΠΟΠ",
    "Δίοπος",
    "Δίοπος ΕΠΟΠ",
    "Κελευστής",
    "Κελευστής ΕΠΟΠ",
    "Κελευστής ΕΜΘ",
    "Κελευστής ΣΜΥΝ",
    "Επικελευστής ΕΠΟΠ-ΕΜΘ",
    "Επικελευστής ΣΜΥΝ",
    "Αρχικελευστής ΕΠΟΠ-ΕΜΘ",
    "Αρχικελευστής ΣΜΥΝ",
    "Ανθυπασπιστής Π.Ν.",
    "Σημαιοφόρος Επίκουρος Αξιωματικός",
    "Σημαιοφόρος",
    "Ανθυποπλοίαρχος",
    "Υποπλοίαρχος",
    "Πλωτάρχης",
    "Αντιπλοίαρχος",
    "Πλοίαρχος",
    "Αρχιπλοίαρχος",
    "Υποναύαρχος",
    "Αντιναύαρχος",
    "Ναύαρχος",
  ];

  const landVathmoi = [
    "Ψάρακας",
    "Υποδεκανέας",
    "Δεκανέας ΟΒΑ",
    "Δεκανέας ΕΠΟΠ-ΕΜΘ",
    "Λοχίας ΕΠΟΠ-ΕΜΘ",
    "Λοχίας ΣΜΥ",
    "Επιλοχίας ΕΠΟΠ-ΕΜΘ",
    "Επιλοχίας ΣΜΥ",
    "Αρχιλοχίας ΕΠΟΠ-ΕΜΘ",
    "Αρχιλοχίας ΣΜΥ",
    "Ανθυπασπιστής Σ.Ξ.",
    "ΔΕΑ (Δόκιμος)",
    "Ανθυπολοχαγός",
    "Υπολοχαγός",
    "Λοχαγός",
    "Ταγματάρχης",
    "Αντισυνταγματάρχης",
    "Συνταγματάρχης",
    "Ταξίαρχος Σ.Ξ.",
    "Υποστράτηγος",
    "Αντιστράτηγος",
    "Στρατηγός",
  ];

  const airVathmoi = [
    "Ψάρακας",
    "Σμηνίτης ΕΠΟΠ",
    "Υποσμηνίας ΕΠΟΠ",
    "Κληρωτός Σμηνίας",
    "Σμηνίας ΕΜΘ-ΕΠΟΠ",
    "Σμηνίας ΣΤΥΑ",
    "Επισμηνίας ΕΜΘ-ΕΠΟΠ",
    "Επισμηνίας ΣΤΥΑ",
    "Αρχισμηνίας ΜΕΕ-ΕΜΘ-ΕΠΟΠ",
    "Αρχισμηνίας ΣΤΥΑ",
    "Ανθυπασπιστής Π.Α.",
    "Ανθυποσμηναγός",
    "Υποσμηναγός",
    "Σμηναγός",
    "Επισμηναγός",
    "Αντισμήναρχος",
    "Σμήναρχος",
    "Ταξίαρχος Π.Α.",
    "Υποπτέραρχος",
    "Αντιπτέραρχος",
    "Πτέραρχος",
  ];

  const quotes = [
    "Του στρατού τα βάσανα αρχίζω με παράπονα με μάτια βουρκωμένα και του στρατού τα βάσανα τα γράφω ένα-ένα",
    "Ήμουν δεκαεννιά χρονώ μέσα στην πρώτη νιότη σαν ήρθε η διαταγή να πάω για στρατιώτης",
    "Μαύρος βαρύς ο ουρανός στις πέντε του Απρίλη την ώρα που στεκόμουνα απέξω από την πύλη",
    "Στο Κέντρο όταν πήγαινα για να υπηρετήσω ενόμιζα πως ήτανε ταβέρνα να γλεντήσω",
    "Ημέρα Τρίτη ήτανε που μπήκα μες το κέντρο με βάλανε και έτρεχα σαν το Θανάση Βέγγο",
    "Την πύλη σαν επέρναγα ήρθανε δυο πουλάκια το ένα μού λέει υπομονή και τ’ άλλο δυο χρονάκια",
    "Της Σπάρτης το στρατόπεδο που ’ναι χιλιάδες μέτρα με βάλαν και το έτρεχα σα να ’μουνα φλορέτα",
    "Ανάθεμα την τύχη μου που μ’ έκανε φαντάρο κι έφυγα από το σπίτι μου χωρίς να το γουστάρω",
    "Την πρώτη μου τη γκόμενα τη λέγανε Μι Ένα τη χάιδευα την έτριβα σα να ’τανε παρθένα",
    "Εγώ πολίτης ήμουνα η πιο μεγάλη λέρα και τώρα στέκω προσοχή μπροστά σε μια σαρδέλα",
    "Μες το στρατό απέκτησα τα τέσσερα βραβεία το ΑΧ το ΒΑΧ το αλίμονο και την ατσιγαρία",
    "Ανέβηκα στα σύρματα να δω την κοινωνία κι ο ίλαρχος μου φώναξε «κατέβα ρε κηδεία»",
    "Έλα μαζί αγάπη μου μαζί μου στην Αυλώνα και γω θα πω στον ίλαρχο πως είσαι νοσοκόμα",
    "Την Κυριακή οι άνθρωποι πηγαίνουν εκκλησία και γω γυρίζω από σκοπιά και πάω αγγαρεία",
    "Όταν βρισκόμουν στη σκοπιά θυμήθηκα εσένα μα αντί για το χεράκι σου βαστούσα το Μι Ένα",
    "Μην κλαις μανούλα μου γλυκιά που λείπω από κοντά σου χίλιες μανούλες βρίσκονται στη θέση τη δίκιά σου",
    "Μέσα στης Σπάρτης τα βουνά περίπολο γυρίζω κι εσένα αγάπη μου γλυκιά θυμούμαι και δακρύζω",
    "Τα μακαρόνια του στρατού όλα θα τα ενώσω να φτιάξω σιδηρόδρομο να ρθω να σ’ ανταμώσω",
    "Αυτά τα ρούχα που φορώ κάποτε θα τα βγάλω και τη ζωή που έκανα θα τηνε ξανακάνω",
    "Το κράνος είναι ασήκωτο με πιάνει η κεφαλή μου μα έτσι με διατάζουνε να κάνω οι λοχαγοί μου",
    "Το ούφο εμφανίστηκε και πάλι στην Αρόη και ο σκοπός που φύλαγε τα ’κανε στο παντελόνι",
    "Το φανταράκι στο στρατό να μην το λησμονάτε κουράγιο να του δίνετε να το παρηγοράτε",
    "Το όνομά σου το γλυκό από το Ε αρχίζει το ‘βαλα στην καρδούλα μου κι όλο με βασανίζει",
    "Το όπλο έχω αδερφό το κράνος για πατέρα την ξιφολόγχη αδερφή και τη σκοπιά μητέρα",
    "Το όπλο μάνα είναι βαρύ και μου ‘σπασε τον ώμο σκέφτομαι την καραμπίνα μου που κυνηγούσα μόνος",
    "Τσιγάρο μ’ απαρνήθηκες γόπα δε με θυμάσαι και συ καημένη πακετιά στο Καψιμί κοιμάσαι",
    "Τώρα κλείνω το γράμμα μου μ’ ένα γλυκό φιλάκι στα χείλη σου τα όμορφα γλυκό μου κοριτσάκι",
    "Φαντάρο κι αν με πήρανε δε θέλω να λυπάσαι ένα μονάχα σου ζητώ πάντα να με θυμάσαι",
    "Φαντάρο όταν βλέπετε να δείχνετε συμπόνια γιατί δεν ξέρετε τι περνά μέσα σε δύο χρόνια",
    "Φαντάρος είμαι αγάπη μου και βρίσκομαι μακριά σου μα θα περάσει ο καιρός και θα βρεθώ κοντά σου",
    "Χαράματα σηκώνομαι και πριν από τις κότες γυρνάω το στρατόπεδο για να μαζέψω γόπες",
    "Μου ‘πε ακόμα να σου πω πως δε σε λησμονάει σε περιμένει για να ρθεις γιατί σε αγαπάει",
    "Σου γράφω γράμμα αγάπη μου δεν θέλω να δακρύσεις μόνο μια χάρη σου ζητώ να μη με λησμονήσεις",
    "Σου στέλνω γράμμα να χαρείς κι όχι να σε πληγώσει και τη φωτογραφία μου κουράγιο να σου δώσει",
    "Σου στέλνω τριαντάφυλλα απ’ του στρατού τον κήπο για να μετράς αγάπη μου τις μέρες που θα λείπω",
    "Στα πέντε μέτρα θα σταθώ και πάρε το πιστόλι και στην καρδιά μου άδειασε τη γεμιστήρα όλη",
    "Εχτές το βράδι στη σκοπιά σκεφτόμουνα εσένα κι αντί για τα χειλάκια σου φιλούσα το Μι Ένα",
    "Στην Κόρινθο όποιος βρεθεί και δεν τηνε μισήσει του δίνω τη διεύθυνση να ρθει να με γαμήσει",
    "Στην προσοχή κουνιόμουνα απ’ το πολύ το κρύο κι ο λοχαγός διέταξε τρεις μέρες πειθαρχείο",
    "Στης Θήβας το στρατόπεδο που ‘ναι μεγάλο κέντρο με πιάσαν με κουρέψανε σαν το Θανάση Βέγγο",
    "Στης Σπάρτης το στρατόπεδο με κλείσανε κι εμένα και μέρα νύχτα σκέφτομαι μανούλα μου εσένα",
    "Στης Σπάρτης το στρατόπεδο με τα βαριά τιμόνια εκεί παιδεύουν τα παιδιά στα είκοσι τους χρόνια",
    "Στις δώδεκα σηκώθηκα να πάω στη σκοπιά μου και τότε σε θυμήθηκα και ράγισε η καρδιά μου",
    "Στο Ξεροκάμπι βγήκαμε και πήγα ένα βράδυ μα μπήκα στο στρατόπεδο με στεναχώρια πάλι",
    "Στο θάλαμο που βρίσκομαι έχει είκοσι κρεβάτια στο τελευταίο είμαι εγώ με την καρδιά κομμάτια",
    "Στο θάλαμο καθόμουνα και κάπνιζα στη ζούλα και ο καπνός σχημάτιζε τη λέξη «αγαπούλα»",
    "Στο κέντρο όταν μπήκαμε μας κλείσαν σαν τ’ αρνάκια είκοσι μέρες κάναμε να δούμε φουστανάκια",
    "Στο πειθαρχείο μ’ έστειλε ο λοχαγός να πάω γιατί επάνω στ’ όπλο μου έγραψα σ’ αγαπάω",
    "Στο πονεμένο στήθος μου γιατρός δε βάζει χέρι τα φάρμακα δε μ’ ωφελούν αν δεν απολυθώ Σεπτέμβρη",
    "Στο σπίτι όταν κάθεσαι εμένα να θυμάσαι κι όταν διαβάζεις γράμμα μου ποτέ να μη λυπάσαι",
    "Στον ύπνο μου σε έβλεπα πάλι απόψε μάνα και το πρωί όταν ξύπνησα με λίγωσε το κλάμα",
    "Στρατώνες να ρημάξετε σκοπιές να γκρεμιστείτε που ‘χετε το κορμάκι μου και το ταλαιπωρείτε",
    "Τα λούλουδα μαραίνονται και τα λεφτά σκορπιώνται μα του στρατού τα βάσανα ποτέ δε λησμονιώνται",
    "Τα νιάτα μου τα όμορφα και τα καλά μου χρόνια τα χαίρεται το Τεχνικό, το κρύο και τα χιόνια",
    "Τα πιο μεγάλα βάσανα περνάει ο γιος σου μάνα γιατί τονε σκλαβώνουνε και τρώει στην καραβάνα",
    "Τα πιο μεγάλα βάσανα περνάει ο στρατιώτης γιατί τονε σκλαβώνουνε μες τον ανθό της νιότης",
    "Τα ρούχα τα στρατιωτικά πολλοί τα προτιμάνε όμως δεν ξέρουν τι τραβούν αυτοί που τα φοράνε",
    "Τα ρούχα μου είναι βρώμικα και ποιος θα μου τα πλύνει σκέφτομαι σένα μάνα μου στη γούρνα όταν πλύνεις",
    "Τη λεβεντιά το μπόι μου τα πιο καλά μου χρόνια θα τα χαρούν τα Άλφα-Ταυ με τα βαριά κανόνια",
    "Τη μέρα που χωρίσαμε συνάντησα το χάρο την άλλη μέρα το πρωί με ντύσανε φαντάρο",
    "Τη μια είμαι περίπολο την άλλη είμαι σκοπός ρεζίλι με κατάντησε ο Ελληνικός Στρατός",
    "Τη νύχτα ονειρεύομαι πως σε φιλώ στο στόμα και το πρωί όταν ξυπνώ τη γλύκα νιώθω ακόμα",
    "Την ολοπράσινη στολή όταν θα την αφήσω και πάλι στο κορίτσι μου με χίλια θα γυρίσω",
    "Την πρώτη μέρα στο στρατό είχαμε μελιτζάνες και σαν βαρκούλες πλέανε μέσα στις καραβάνες",
    "Της Λήμνου τ’ άγρια βουνά με πόνο τ’ ανεβαίνω μα όσο εσένα σκέφτομαι θα ζω και θ’ ανασαίνω",
    "Τι να τα κάνω τα λεφτά και τη χρυσή μου νιότη τώρα που αγάπησα και γω με πήρανε στρατιώτη",
    "Τι σου ‘κανα βρε λοχαγέ και σένα επιλοχία και μόλις βγω για άδεια με στέλνετε αγγαρεία",
    "Το δέντρο που επότιζες μανούλα στην αυλή σου τώρα το πήρε ο στρατός και μένεις μοναχή σου",
    "Το αχ το λένε μια φορά και γω το δευτερώνω γιατί έχω πόνο στην καρδιά και δεν το φανερώνω",
    "Το γράμμα το τελείωσα τον φάκελο τον κλείνω αυτό θα έρθει να σας βρει μα εγώ εδώ θα μείνω",
    "Το διπλωμένο αυτό χαρτί ποτέ να μην τ’ ανοίξεις γιατί θα βρεις απ’ το στρατό μεγάλες αναμνήσεις",
    "Ο λοχαγός με ρώτησε τι έκανα πολίτης και γω τον αποκρίθηκα πως ήμοννα ξενύχτης",
    "Ο χώρος της αναφοράς μοιάζει με μια αλάνα και κει κάθε ξημέρωμα πέφτει πολλή καμπάνα",
    "Οι μάγκες δεν υπάρχουν πια τους πήρανε στρατιώτες στης Πάτρας το στρατόπεδο για να μαζεύουν γόπες",
    "Ολημερίς στο γήπεδο στο «ένα» και το «δύο» κι αν χάσεις το βηματισμό σε στέλνουν πειθαρχείο",
    "Όλο τον κόσμο γύρισα ανατολή και δύση σαν του στρατού τα βάσανα δεν έχω συναντήσει",
    "Όλοι κάνουνε σπίτι τους Χριστούγεννα και Πάσχα και γω δακρύζω στη σκοπιά με όπλο και μπαλάσκα",
    "Όλοι αλλάζουν Κυριακή και πάνε εκκλησία και γω γυρίζω από σκοπιά και πάω αγγαρεία",
    "Όλος ο κόσμος τραγουδά χορεύει διασκεδάζει μα του φαντάρου η καρδιά μονάχη αναστενάζει",
    "Όποιος δεν έχει βάσανα και θέλει ν’ αποκτήσει στης Λήμνου τα στρατόπεδα να ρθει να υπηρετήσει",
    "Όποιος το βλέπει το χακί πολύ θα του αρέσει την πίκρα όμως θα τη δει όταν θα το φορέσει",
    "Όποιος φορέσει το χακί και δεν αγανακτήσει ή μπάρμπα θα ’χει στρατηγό ή κώλο θα ‘χει στήσει",
    "Ορκίζομαι αγάπη μου πως δεν θα σε ξεχάσω όπου και να με ρίξουνε κοντά σου πάλι θα ‘ρθω",
    "Όσα ποτάμια κι αν διαβώ, θάλασσες κι αν περάσω το όνομά σου αγάπη μου ποτέ δεν θα ξεχάσω",
    "Όταν ακούω τη βροχή και βλέπω τα πουλάκια θυμάμαι κάτω στο χωριό που ’στηνα ξοβεργάκια",
    "Όταν βραδιάζει μάνα μου και βγει το φεγγαράκι με πιάνει το παράπονο και κλαίω σαν παιδάκι",
    "Όταν θα βγάλω το χακί και θα γενώ πολίτης ξανά στο γκομενάκι μου και πάλι θα ’μαι αλήτης",
    "Όταν θα βγεις αναφορά μαζί με άλλους δέκα είναι σα να παντρεύεσαι μία γριά γυναίκα",
    "Όταν θα λάβω γράμμα σου πάω και το διαβάζω μονάχος μου σε μια γωνιά κλαίω κι αναστενάζω",
    "Όταν θα μπεις στο θάλαμο με τα πολλά κρεβάτια στο τελευταίο θα με βρεις με την καρδιά κομμάτια",
    "Όταν θα πάρω άδεια έχω χαρά μεγάλη μα όταν πίσω έρχομαι με ξαναπιάνει ζάλη",
    "Όταν Θα πάψει να γυρνά η γη στον άξονά της τότε και η αγάπη μας θα σπάσει τα δεσμά της",
    "Όταν ξυπνάω το πρωί το θάλαμο κοιτάζω δεν βλέπω την αγάπη μου και βαριαναστενάζω",
    "Όταν παιδιά απολυθώ θα πάω να τα σπάσω τα δύο χρόνια στο στρατό θέλω να τα ξεχάσω",
    "Όταν πεινάω μάνα μου σκέφτομαι το σπιτάκι που ερχόμουνα και έτρωγα ό,τι είχα εγώ μεράκι",
    "Όταν σκεφτώ το σπίτι μου και θυμηθώ τη Νάξο μέσα απ’ τα βάθη της καρδιάς θα βαριαναστενάξω",
    "Όταν το δίσκο πάρουμε και το φαΐ βρομάει σκέφτομαι το φαγάκι σου και κλαίω με μαράζι",
    "Ο,τι κι αν λες κυρ διοικητά είναι δικαίωμά μου πάντα παντού και πάντοτε να γράφω τ’ όνομά μου",
    "Πάνω στο όπλο που κρατώ σ’ έχω ζωγραφισμένη σε κάθε δύσκολη στιγμή σε βλέπω δακρυσμένη",
    "Πέντε με οχτώ είμαι σκοπός τη θάλασσα αντικρίζω σε σκέφτομαι αγάπη μου κι ολημερίς δακρύζω",
    "Πολίτης ήμουν κι έλεγα πότε θα υπηρετήσω ενόμιζα πως θα ’τανε στ’ Αστέρια να γλεντήσω",
    "Πότε σκοπός στα Καύσιμα πότε σκοπός στην πύλη και πότε στην αναφορά με πικραμένα χείλη",
    "Περιστεράκι μου γλυκό τρέξε γοργά σαν σφαίρα πήγαινε στην αγάπη μου και πες της καλημέρα",
    "Φαντάρος πάω κούκλα μου δε θέλω να δακρύσεις ένα μονάχα σου ζητώ να μη με λησμονήσεις",
    "Προτού φορέσω το χακί έλεγα δε με νοιάζει μα τώρα που το έβαλα με τρώει το μαράζι",
    "Πρωί πρωί σηκώνομαι βολή να πάω να κάνω μα όταν εσένα σκέφτομαι το στόχο πάντα χάνω",
    "Πρωί πρωί σηκώνομαι με πόνο και με κλάμα και στρώνω το κρεβάτι μου σα να μην έχω μάνα",
    "Πρωί πρωί στο μάθημα το βράδι στα καζάνια δε μένει ώρα αγάπη μου για να σου γράψω γράμμα",
    "Σ’ αγάπησα και δεν μπορώ μακριά σου για να ζήσω αλλά θα κάνω υπομονή και πίσω θα γυρίσω",
    "Σ’ αυτή την άκρη του χαρτιού δεν γράφω φλυαρίες μόν’ του στρατού τα βάσανα και τις ταλαιπωρίες",
    "Σ’ αυτό το άψυχο χαρτί δεν ξέρω τι να γράψω μόνο τη λέξη «σ’ αγαπώ» και δεν θα σε ξεχάσω",
    "Σας στέλνω ένα ενθύμιο απ’ το στρατό βγαλμένο και σεις μη με ξεχάσετε γράμμα σας περιμένω",
    "Σε γνώρισα μία βραδιά που ήμουνα πολίτης και τώρα χωριστήκαμε που έγινα οπλίτης",
    "Σε ξένη πόλη βρίσκομαι σε ξένη επαρχία σου στέλνω το κορμάκι μου σε μια φωτογραφία",
    "Σήμερα είναι Κυριακή χτύπησαν οι καμπάνες και μένα τα χεράκια μου πλένουνε καραβάνες",
    "Σήμερα έχω έξοδο θα πάω να μεθύσω να θυμηθώ πώς ήμουνα προτού υπηρετήσω",
    "Σιγά σιγά με προσοχή διάβασε αυτή την κόλλα τα βάσανα από το στρατό εδώ τα γράφει όλα",
    "Σκέφτομαι όταν φώναζες να πάω στο σχολείο και τώρα πάω στη σκοπιά με ζέστη και με κρύο",
    "Σκοπιά καθώς ξεκίνησα να πάω να φυλάξω θυμήθηκα εσένανε και κόντευα να κλάψω",
    "Σκοπιά που μ’ ερωτεύτηκες δεν είσαι με τα καλά σου αφού μια μέρα θα το δεις θα φύγω μακριά σου",
    "Σκοπός εγώ όταν ήμουνα ήρθε ένα πουλάκι και μου ’πε απ’ την αγάπη σου σού φέρνω γραμματάκι",
    "Ο ήλιος βγαίνει το πρωί κι ανθίζει τα χορτάρια μ’ αυτή η πράσινη στολή μαραίνει παλικάρια",
    "Έγινε το μαλλάκι μου πήγα να το χτενίσω και πάλι μου το κόψανε πήγα ν’ αυτοκτονήσω",
    "Να ήμουνα μικρό πουλί τον ουρανό να σκίσω να ‘ρθω κοντά σου αγάπη μου εσένα να φιλήσω",
    "Φίλοι μου με ξεχάσατε δεν είμαι πεθαμένος είμαι σ’ ένα στρατόπεδο μες το χακί ντυμένος",
    "Ξέχασα τι θα πει ζωή όλα τα ‘χω ξεχάσει εδώ μες το στρατόπεδο το νου μου έχω χάσει",
    "Ο Βόλος θέλει παίδαρους παιδιά με ψυχραιμία ν’ αντέχουνε στα βάσανα και την ταλαιπωρία",
    "Γιατί είμαι μελλοθάνατος και καταδικασμένος δεκαεννιά χρονώ παιδί μες το ΚΕΕΜ κλεισμένος",
    "Με πέντε μόνο γράμματα και με γλυφό το δάκρυ γράφω αυτή τη συλλαβή που λέγεται ΑΓΑΠΗ",
    "Με πολυβόλο Μπράουνιγκ θα ’ρθω στη γειτονιά σου να κάνω πραξικόπημα να μπω μες την καρδιά σου",
    "Με πόνο πιάνω το χαρτί με δάκρυα την πένα για να σου γράψω αγάπη μου πώς τα περνώ στα ξένα",
    "Με τσάκισαν τα βάσανα με ρήμαξαν οι πόνοι άμα δε βγάλω το χακί τίποτα δε με σώνει",
    "Μέσα σε ένα θάλαμο κοιμόμαστε όλοι μάνα μα μόλις σβήνουνε το φως με πιάνει μαύρο κλάμα",
    "Μέσα στης Σπάρτης τα βουνά λαλούνε τα αηδόνια και μένα μες το θάλαμο μου κάνουνε καψόνια",
    "Μεσάνυχτα επήγαινα σκοπιά για να φυλάξω εσένα εσκεφτόμουνα και μου ‘ρθε για να κλάψω",
    "Μες της καρδιάς μου το κελί σ’ έχω βαθιά κλεισμένη και να σε βλέπω δεν μπορώ γλυκιά μου αγαπημένη",
    "Μες το χακί με ντύσανε σαν φύλλο πρασινίζω θυμάμαι εσένα αγάπη μου και συνεχώς δακρύζω",
    "Μη με κοιτάς μη με ρωτάς μη μου κρατάς κακία να σου μιλήσω δε μπορώ είμαι φωτογραφία",
    "Μη με ξεχνάς αγάπη μου φαντάρος τώρα που ’μαι να μ’ αγαπάς να σ’ αγαπώ να μη λησμονηθούμε",
    "Μη με ξεχνάτε φίλοι μου δεν είμαι πεθαμένος είμαι μονάχα μακριά και στο χακί ντυμένος",
    "Μη σου φανεί παράξενο συνθέτης που ‘χω γίνει αφού η πολλή αγάπη σου την έμπνευση μου δίνει",
    "Μην αγαπήσεις φίλε μου προτού να υπηρετήσεις γιατί άμα το καλοσκεφτείς μπορεί ν’ αυτοκτονήσεις",
    "Μην κλαις αγάπη μου γλυκιά που λείπω από κοντά σου κι άλλα κορίτσια βρίσκονται στη θέση τη δικιά σου",
    "Σ’ αυτό το άψυχο χαρτί δε γράφω φλυαρίες μόνο τη λέξη «σ’ αγαπώ» χωρίς αμφιβολίες",
    "Μην κλαις γλυκιά μανούλα μου που ο γιος σου υπηρετεί είκοσι μήνες θα ‘ρθουνε και θα απολυθεί",
    "Μην με ξεχνάς αγάπη μου δεν είμαι πεθαμένος στης Γκατζολίας τα βουνά είμαι φυλακισμένος",
    "Μήνες θα κάνω να σε δω μήνες να σου μιλήσω μα μη θαρρείς αγάπη μου πως θα σε λησμονήσω",
    "Μια μέρα δεν επέρασε μάνα μου να μην κλάψω μια μέρα δεν επέρασε να μη σκεφτώ τη Νάξο",
    "Μου κόψαν τα μαλλάκια μου, μου κόψανε το βήχα στ’ αρχίδια μου τους έγραψα και την υγειά μου βρήκα",
    "Μου κόψαν τα μαλλάκια μου και μου ’δοσαν τσατσάρα κι εγώ από τον πόνο μου την έκανα κιθάρα",
    "Τότε και γω τσαντίστηκα και του ’πα θυμωμένος θέλω την άδεια λοχαγέ γιατί ’μαι ερωτευμένος",
    "Βαρέθηκα το λοχαγό, του λόχα τη σφυρίχτρα και το θαλαμοφύλακα να με ξυπνά τη νύχτα",
    "Το Σάββατο ελεύθερος την Κυριακή αργία κι απ’ τη Δευτέρα το πρωί μου βγαίνει η παναγία",
    "Βάσανα έχει το χακί και πίκρες το κορδόνι και κάθε νιος που το φορεί τα νιάτα του σκλαβώνει",
    "Να ’μουν αητός να πέταγα μικρό πουλί να φύγω ψηλά από τα σύρματα να ’ρθω κοντά σου λίγο",
    "Μάνα γιατί με γέννησες και μ’ έκανες αγόρι και μ ’ έχουν ντύσει στο χακί που ’χει μεγάλο ζόρι",
    "Μην τα κοιτάς τα γράμματα που ’ναι στραβά γραμμένα είναι γραμμένα στη σκοπιά με μάτια δακρυσμένα",
    "Όταν τη Νάξο σκέβομαι τη μάνα μου φωνάζω με πιάνει το παράπονο και βαριαναστενάζω",
    "Σκοπιές ποινές αναφορές ποτέ δε θα ξεχάσω θα τις θυμάμαι πάντοτε μέχρι που να γεράσω",
    "Αγάπα με να σ’ αγαπώ και να το επιμένεις φαντάρο κι αν με πήρανε πρέπει να περιμένεις",
    "Το φανταράκι στο στρατό όλοι το λησμονάνε σαν το ξωκκλήσι στο βουνό που δεν το λειτουργάνε",
    "Αγάπη μου που βρίσκεσαι μόνη χωρίς εμένα θέλω να μην ξεχνάς ποτέ πως ζω μόνο για σένα",
    "Άλλος για Χίο τράβηξε κι άλλος για Μυτιλήνη κι άλλος στης Σπάρτης τα βουνά αίμα και δάκρυα χύνει",
    "Αν είσαι κλέφτης στα βουνά φονιάς μέσα στην πόλη σπιούνος ή ψευδομάρτυρας θα σ’ αγαπήσουν όλοι",
    "Αν ήμουνα αρματιστής και τανκς αν οδηγούσα όλα θα τα ισοπέδωνα για να σε συναντούσα",
    "Αν κάποτε στη μνήμη σου σβηστεί το όνομά μου θα μείνουν για ενθύμιο τα τόσα γράμματά μου",
    "Ανάθεμα την άμαξα με τα πολλά βαγόνια που μ’ έφερε στην Κόρινθο να τρώω μακαρόνια",
    "Ανάμεσα σε δυο βουνά θα ρίξω την κορδέλα αν μ’ αγαπάς αγάπη μου πάρε το δρόμο κι έλα",
    "Ανοιξε την καρδούλα μου στα τέσσερα κομμάτια μέσα θα δεις ζωγραφιστά τα δυο γλυκά σου μάτια",
    "Απ’ τα πολλά τα βάσανα και τους καημούς που πίνω με κάνανε αγάπη μου και ποιητής να γίνω",
    "Απ’ τη μονάδα που θα βγω καθόλου δεν θ’ αργήσω να ‘ρθω κοντά σου αγάπη μου να σε γλυκοφιλήσω",
    "Απάνω στο τιμόνι μου το όνομά σου γράφω για να μη σε ξεχνώ ποτέ όταν είμαι μονάχος",
    "Από μικρός σ’ αγάπησα και σ’ αγαπώ ακόμα και αν σε χάσω αγάπη μου θα μπω στο μαύρο χώμα",
    "Απολύομαι στραβάδια – δεν κοιμάμαι πια τα βράδια Απολύομαι ψαρούκλες – τα μαλλιά μου κάνω μπούκλες",
    "Αφησα τα χωράφια μας ζώα και μηχανάκια και μες της Σπάρτης τα βουνά κλαίω σαν τα μωράκια",
    "Αχ και να σ’ είχα στη σκοπιά να χάιδευα εσένα όπως χαϊδεύω κούκλα μου τώρα το",
    "Μι Ένα Βαρέθηκα κορίτσι μου μες τη γραμμή να στέκω τον ταχυδρόμο να ρωτώ δικό σου γράμμα αν έχω",
    "Βαρέθηκα ρε φίλε μου επώμου παραπόδα και οκλαδόν εγέρθητι χίλιες φορές την ώρα",
    "Βουνά και δάση πέρασα κύματα αγριεμένα λεπτό της ώρας δεν περνά να μη θυμάμαι εσένα",
    "Γαλέτες μας ταΐζουνε και γάλα αρκετό μα όλοι τώρα έχουμε σαράντα πυρετό",
    "Γερμανικό το νούμερο που πάω να φυλάξω και δυνατό το AΛT ΤΙΣ ΕΙ που πρέπει να φωνάξω",
    "Για ένα μικρό παράπτωμα για ένα μικρό αστείο δε λογαριάζουν τίποτα σε κλείνουν πειθαρχείο",
    "Γονείς μου σας χαιρετώ τι κάνετε πώς είστε μια μέρα αργά ή γρήγορα πολίτη θα με δείτε",
    "Γράμμα από το σπίτι μου έχω καιρό να πάρω σίγουρα τον ξεχάσανε τον έρμο το φαντάρο",
    "Γράμμα μου σκίσε τα βουνά τρέξε γοργά σα σφαίρα πήγαινε στο κορίτσι μου και πες του καλημέρα",
    "Γράμμα σού στέλνω αδερφή δε θέλω να δακρύσεις μονάχα μία επιταγή να με παρηγορήσεις",
    "Γυναίκες με κοιτάγανε απ’ τ’ απέναντι μπαλκόνι κι εμένα μες το θάλαμο μου κάνανε καψόνι",
    "Δε λησμονώ αγάπη μου το πότε θα γυρίσω και τις χαμένες μας χαρές σε σένα θα χαρίσω",
    "Δε φταίω γω κορίτσι μου που είσαι τώρα μόνη για τούτο φταίει ο στρατός κι αυτό με μαραζώνει",
    "Δέκα Ναξιώτες είμαστε και κάνουμε παρέα μα όλοι στεναχωριόμαστε που εδώ δεν είναι ωραία",
    "Δεν είναι κρίμα κι άδικο μέσα σ’ αυτή τη νιότη τώρα που αγάπησα κι εγώ με παίρνουνε στρατιώτη;",
    "Δεν είναι κρίμα κι άδικο να είμαι εγώ φαντάρος και τη δική μου γκόμενα να τη γαμάει άλλος;",
    "Δεν έλπιζα αγάπη μου να ρθω σε τέτοιο χάλι να καθαρίζω στο στρατό πατάτες με κουτάλι",
    "Δεν ήθελα κορίτσι μου να φύγω να σ’ αφήσω μα βλέπεις ήρθε ο καιρός να πάω να υπηρετήσω",
    "Δεν με πειράζει του στρατού το βάρος να σηκώνω αρκεί να μ’ αγαπάς εσύ για να ξεχνώ τον πόνο",
    "Δεν μου κάνουν πια τα ρούχα – απολύομαι κληρούχα Δεν το ’λπιζα μανούλα μου να πλένω καραβάνα να πλένω τις καλτσούλες μου σα να μην έχω μάνα Δώσε μικρούλα προσοχή σ’ αυτά που θα διαβάσεις φαντάρο αν αγάπησες ποτέ μην τον ξεχάσεις",
    "Δύο Φλεβάρη ήτανε που έκλαψε η καρδιά μου μου κόψανε με την ψιλή τα όμορφα μαλλιά μου",
    "Δύο βδομάδες πέρασα με πόνο και με κλάμα δύο βδομάδες κέρασα χωρίς να λάβω γράμμα",
    "Δυο ώρες στη γυμναστική και πέντε στην πορεία και μία μόνο ελεύθεροι κι αυτή στην αγγαρεία",
    "Εγώ ποτέ δε σε ξεχνώ κι ας είμαι φανταράκι έτσι με μάθαν στο στρατό μικρό μου κοριτσάκι",
    "Είδα στ’ όνειρό μου ελάφια – απολύομαι πιλάφια",
    "Είκοσι μέρες μείνανε να φύγω από τη Σπάρτη να βάλω πίσω μου φωτιά να γίνουν όλα στάχτη Είκοσι μήνες στο στρατό έχασα τα μυαλά μου και ρώταγα τους φίλους μου ποιο είναι τ’ όνομά μου",
    "Είναι κακούργα η ξενιτειά είναι καημός τα ξένα μα πιο πολύ μαράζωσα που ζω μακριά από σένα",
    "Επάνω στο τιμόνι μου σ’ έχω ζωγραφισμένη σε κάθε στραβοτιμονιά σε βλέπω δακρυσμένη",
    "Εκλάδεψα το γιασεμί και άφησα δυο κλώνους αν μ’ αγαπάς αγάπη μου περίμενε δυο χρόνους",
    "Εμένα το κορμάκι μου το κρύο θα το λιώσει κι ο πυρετός της άδειας το νου μου θα θολώσει",
    "Ένας φαντάρος περπατά μες το χακί ντυμένος στα χείλη είναι γελαστός μα στην καρδιά κλαμένος",
    "Επήρα μία δίωρη και βγήκα ένα βράδι και οι πολίτες φώναζαν «κοιτάτε ένα στραβάδι»",
    "Επήρα μία δίωρη και πήγα στην πουτάνα μα το μουνί σιχάθηκα που ’ταν σα μελιτζάνα",
    "Εσένα έχω στο μυαλό εσένανε θυμάμαι για σένα κάθομαι σκοπιές, για σένα δεν κοιμάμαι",
    "Εσύ πηγαίνεις ντισκοτέκ και στις καφετερίες και γω αλλάζω τις σκοπιές και κάνω αγγαρείες",
    "Εσύ στο μπαλκονάκι σου και γω στη διμοιρία εσύ θα πας στη ντισκοτέκ και γω στην αγγαρεία",
    "Εσύ στο παραθύρι σου και γω στη διμοιρία εσύ γαμιέσαι μ’ άλλονε και γω απ’ το λοχία",
    "Εφτά γιατροί μ’ εξέτασαν και τρεις μου πήραν αίμα και τέσσερις μου είπανε πως αγαπώ εσένα",
    "Έχασα το λογαριασμό τις μέρες να μετράω μα όπου κι αν με ρίξουνε τη Νάξο δεν ξεχνάω",
    "Έχει εδώ στο Καψιμί έγχρωμη για να βλέπω μα δεν είν’ το κρεβάτι μου απέναντι να πέφτω",
    "Έχω ένα ελάττωμα πάντως δικαίωμά μου πάντα παντού και πάντοτε να γράφω τ’ όνομά μου",
    "Έχω πολλά ρε φίλε μου ακόμα να σου γράψω μα ήρθε η ώρα για σκοπιά και πάω να φυλάξω",
    "Η διαταγή εδόθηκε με πλήρεις εξαρτύσεις ξεκίνησα για το βουνό να κάνω τις ασκήσεις",
    "Η ώρα είναι μιάμιση και γω το φανταράκι φυλάω αρβυλοφύλακας στο έξω θαλαμάκι",
    "Ημέρα Τρίτη ήτανε μέρα καταραμένη που ’φυγα απ’ το σπιτάκι μου με την καρδιά καμένη",
    "Ημέρες δύο μείνανε γι’ αυτή την άγια άδεια όμως δεν ήρθε επιταγή κι η τσέπη είναι άδεια",
    "Θα γίνω πολυβολητής να ρθω στη γειτονιά σου να κάνω επανάσταση να μπω στην αγκαλιά σου",
    "Θα έβγω στην αναφορά μάνα μου να φωνάξω πως θέλω μια εξαήμερη να πάω για τη Νάξο",
    "Θαλαμοφύλακα μ’ έβαλαν φρουρά στη διμοιρία και γω για ύπνο έπεφτα και ξύπναγα στις μία",
    "Θεέ μου τι σου έκανα και μου κρατάς κακία και σκλάβωσες τα νιάτα μου σ’ αυτή τη διμοιρία",
    "Καλύτερα μανούλα μου να μ’ έστελνες στο χάρο παρά που με μεγάλωσες και μ’ έκανες φαντάρο",
    "Καλύτερα μια ώρα ελεύθερη ζωή παρά δύο χρονάκια να ‘μαι μες το χακί",
    "Καλύτερα στη Φλώρινα με πέντε μέτρα χιόνι παρά στης Σπάρτης τα βουνά το κρύο να με λιώνει",
    "Καραβανάδες προσοχή ανθύπες στοιχηθείτε γιατί εγώ θ’ απολυθώ κι εσείς θα υπηρετείτε",
    "Κάτω απ’ τον Ταΰγετο που ‘ναι γεμάτος χιόνια μ’ έχουνε κλείσει μάνα μου σαν το κλουβί τ’ αηδόνια",
    "Κοιμόμουν κι ονειρεύτηκα πως κέρδισα λαχείο και το πρωί σηκώθηκα και ήμουν πειθαρχείο",
    "Κοίταξε την καρδούλα μου που είναι χάρισμά σου εκεί θα βρεις χίλιες φορές γραμμένο τ’ όνομά σου",
    "Μακριά σου γω κι αν βρίσκομαι ο νους μου είναι κοντά σου και από τα χειλάκια μου δε λείπει τ’ όνομά σου",
    "Μακριά μου συ κι αν βρίσκεσαι και δε σε βλέπω φως μου με τη γλυκιά σου ανάμνηση περνάει ο καιρός μου",
    "Μάνα γιατί με γέννησες και μ’ έκανες φαντάρο δε μ ’ έστελνες καλύτερα από μικρό στο χάρο",
    "Μάνα μου κάνε υπομονή και ίσως σ’ ένα χρόνο να ‘ρθω κοντά στο σπίτι μας για να μην είμαι μόνος",
    "Μάνα μου σε πληροφορώ τα δάκρυα που χύνω πως είναι περισσότερα απ’ το νερό που πίνω",
    "Μάνα που κάθεσαι να φας μέτρησε τα παιδιά σου θα δεις πως το καλύτερο το πήραν μακριά σου",
    "Μανούλα τρέξε όσο μπορείς τρέξε για να με σώσεις και από τη Σπάρτη μάνα μου να μ’ απελευθερώσεις",
    "Ποτέ δεν το περίμενα γυναίκα πως θα γίνω Τετάρτη και Παρασκευή τα ρούχα μου να πλύνω",
    "Αρβύλες μπείτε στη γραμμή κορδόνια στοιχηθείτε γιατί περνάει ο λοχαγός και θα τιμωρηθείτε",
    "Όποιος δε φόρεσε χακί και τη χρυσή κορόνα δεν του αξίζει παντρειά μα ούτε κι αρραβώνα",
    "Τον άρρωστο τον έκανα να πάω νοσοκομείο μα δυστυχώς κατέληξα μέσα στο πειθαρχείο",
    "Μη με κοιτάς αγάπη μου σα να ‘μαι ένας ξένος είμαι εγώ ματάκια μου μες το χακί ντυμένος",
    "Αγάπη μου με ξέχασες δεν είμαι πεθαμένος μέσα στης Σπάρτης τα βουνά είμαι φυλακισμένος",
    "Μπαλάσκες κράνος και γυλιό, σακίδιο παγουράκι όλα μου τα φορτώσανε σα να ‘μουν γαϊδουράκι",
    "Δεν το περίμενα ποτέ να ρθω σε τέτοια χάλια να καθαρίζω μάνα μου πατάτες σε καζάνια",
    "Καλύτερα μιας ώρας ελεύθερος ροκάς παρά σαράντα χρόνια μαλάκας μονιμάς",
    "Τις σφαίρες έχω συντροφιά τον ίλαρχο πατέρα την ξιφολόγχη αδερφή και τη σκοπιά μητέρα",
    "Δεν είναι κρίμα ρε παιδιά εγώ να ’μαι φαντάρος και το κορίτσι π’ αγαπώ να το φλερτάρει άλλος;",
    "Τα βράδια στο φυλάκιο κανένας δε μιλάει γιατί ο καθένας σκέφτεται τα μάτια π’ αγαπάει",
    "Τρεις ώρες στο περίπολο πέντε σκοπιά στην πύλη και πέντε στα Εκρηκτικά με πικραμένα χείλη",
    "Τα πάθη που ‘παθε ο Χριστός τη Μεγαλοβδομάδα παθαίνω καθημερινώς σε τούτη τη μονάδα",
    "Τα πάθη που ‘παθε ο Χριστός παθαίνει ο στρατιώτης γιατί τονε σταυρώνουνε μες τον ανθό της νιότης",
    "Δεν το περίμενα αυτό έτσι να καταντήσω και τα ωραία χρόνια μου στο ΚΕΤΘ να χαραμίσω",
    "Ανάθεμά σε λεβεντιά ανάθεμά σε νιότη τώρα που σε αγάπησα με πήρανε στρατιώτη",
    "Όποιος φορέσει το χακί και δεν αγανακτήσει του δίνω το δικαίωμα να ρθει να με γαμήσει",
    "Όποιος θα πάει στο στρατό και δεν αγανακτήσει ή μπάρμπα θα ‘χει στρατηγό ή τρέλα θα πουλήσει",
    "Μην αγαπήσεις δόκιμο ούτε και δεκανέα μόνο φαντάρο αγάπησε που ’χει καρδιά γενναία",
    "Μην αγαπήσεις στρατηγό ούτε συνταγματάρχη μόνο το φανταράκι σου που ‘χει καρδιά χρυσάφι",
    "Ξημέρωμα της Κυριακής χτυπάνε οι καμπάνες και μέσα δω μανούλα μου χτυπάνε καραβάνες",
    "Δεν το περίμενα ποτέ να γίνω και μοδίστρα να κάνω τον σιδερωτή ακόμα και την πλύστρα",
    "Σαν το πουλί που καρτερεί μες τη φωλιά τη μάνα έτσι και γω θα καρτερώ ένα δικό σου γράμμα",
    "Τ’ αστέρια του υπίλαρχου σαν βλέπω και γυαλίζουν τα μάτια σου τα γαλανά θυμάμαι να δακρύζουν",
    "Για δες καιρό που διάλεξα κορίτσι ν’ αγαπήσω τώρα που μου ‘ρθε το χαρτί να πάω να υπηρετήσω",
    "Γράμμα σου στέλνω αγάπη μου δε θέλω να δακρύσεις μόνο το συντομότερο θέλω να μ’ απαντήσεις",
    "Τα όμορφα τα νιάτα μας, τα πιο καλά μας χρόνια τα χαίρουνται τα άρματα και τα βαριά κανόνια",
    "Για κοίτα πώς κατάντησα στα είκοσι μου χρόνια να σε φιλώ με το χαρτί και όχι με το στόμα",
    "Την ξιφολόγχη που κρατώ στα πέντε δάχτυλά μου αν μάθω πως με ξέχασες θα μπει μες την καρδιά μου",
    "Φωτιά να πέσει κεραυνός να κάψει τις μοδίστρες που ’χουνε ράψει το χακί με χίλιες κουβαρίστρες",
    "Αγάπη μου με ρίξανε σε δυο βουνά αποπίσω δεν φτάνει το χεράκι μου για να σε χαιρετήσω",
    "Γιατί αγάπη μου γλυκιά μας χώρισαν τα δύο εμένα στο στρατόπεδο και σένα στο θρανίο;",
    "Φωτογραφία απ’ το ΚΕΤΘ σκίσε βουνά σα σφαίρα πήγαινε βρες τους φίλους μου και πες τους καλημέρα",
    "Στη Γκατζολία φίλε μου ήρθα να υπηρετήσω μα ώσπου να φύγω από δω τρελός θα καταντήσω",
    "Βαριές οι στάλες της βροχής χτυπάνε τη σκοπιά μου μα πιο βαριά η πλάκωση που δέρνει την καρδιά μου",
    "Τι σου ‘κανα κυρ λοχαγέ κι εσένα επιλοχία και μου ‘κοψες την άδεια χωρίς καμιά αιτία;",
    "Στην πύλη εκαθόμουνα και κάπνιζα τσιγάρο και ο καπνός σχημάτιζε τη λέξη «θα σαλτάρω»",
    "Εγώ κάποτε ήμουνα δικό σου αγοράκι μα τώρα είμαι αγάπη μου του ΛΥΠ το φανταράκι",
    "Το φανταράκι στο στρατό να μην το λησμονάτε με γράμματα κι επιταγές να το παρηγοράτε",
    "Άλλος για Ρίο τράβηξε κι άλλος για 5η ΜΟΜΑ κι εγώ στο Ρηγανόκαμπο σκοπιά φυλάω ακόμα",
    "Αν μ’ αρνηθείς αγάπη μου θα ζήσω λίγες μέρες και τ’ όνομά σου θα γραφτεί στο στήθος μου με σφαίρες",
    "Την πρώτη μέρα στο στρατό μου κόψαν τα μαλλιά μου τη δεύτερη τον τσαμπουκά την τρίτη τη μαγκιά μου",
    "Την πρώτη μέρα φίλοι μου μου κόψαν τα μαλλιά μου τη δεύτερη τον τσαμπουκά την τρίτη τη μιλιά μου την τέταρτη τους έγραψα και βρήκα την υγειά μου Φαντάρο που με πήρανε και κόψαν τα μαλλιά μου μου άλλαξαν τα ρούχα μου μα όχι την καρδιά μου",
    "Στα άρματα με ρίξανε στα τεθωρακισμένα εκεί που πάνε νέα παιδιά και φεύγουν γερασμένα",
    "Βαρύς είναι ο θάνατος βαρύ είναι το χώμα μα του φαντάρου η ζωή βαρύτερη ακόμα",
    "Μεσάνυχτα με ξύπνησαν περίπολο να πάω κι αμέσως εθυμήθηκα εσένα π’ αγαπάω",
    "Δίχως τσιγάρο και καφέ δίχως φιλί και χάδι σα νυχτοπούλι τριγυρνώ περίπολο το βράδυ",
    "Η ώρα είναι τέσσερις και στη σκοπιά στημένος μέσα στο κρύο τη βροχή σαν καταδικασμένος",
    "Ο ίλαρχος εφώναξε γράφτου επιλοχία πενθήμερη φυλάκιση και δέκα αγγαρεία",
    "Ήλιος που βγαίνει την αυγή μαραίνει τα χορτάρια της Σπάρτης το στρατόπεδο μαραίνει παλικάρια",
    "Πέρασαν τα Χριστούγεννα πέρασαν και τα Φώτα και γω σκοπός εφύλαγα στου διοικητή την πόρτα",
    "Δεν το περίμενα αυτό έτσι να καταντήσω και το ωραίο μου μαλλί στη Σπάρτη να τ’ αφήσω",
    "Αν ήμουν τηλεφωνητής το σύρμα να κρατούσα κάθε στιγμή κάθε λεφτό θα σου τηλεφωνούσα",
    "Ένας φαντάρος έρχεται μες το χακί ντυμένος είναι ο γιος σου μάνα μου ο ταλαιπωρημένος",
    "Σου λέω να χωρίσουμε σκοπιά καταραμένη μα συ δε θέλεις άτιμη γιατί ‘σαι ερωτευμένη",
    "Καλύτερα να πούλαγα γκαζόζες λεμονάδες παρά που πήγα κι έμπλεξα με τους καραβανάδες",
    "Εσύ ’σαι στην παρέα σου και γω στο Διδυμότειχο μοίρα κακιά με τυραννάει εμένα το κακότυχο",
    "Το γράμμα σου το διάβασα και ήμουν αγγαρεία πατάτες εκαθάριζα μέσα στα μαγειρεία",
    "Αυτή η σειρά που είμαι γω είναι αυτοκτονία με βλέπω ν’ απολύομαι Δευτέρα Παρουσία",
    "Κοιμάμαι κι ονειρεύομαι πως είμαι απολυμένος και το πρωί σηκώνομαι μες το χακί ντυμένος",
    "Θεέ μεγαλοδύναμε κάνε κι αυτό το θαύμα για να βρεθώ εκπαιδευτής σε γυναικείο τάγμα",
    "Εβγήκα στην αναφορά άδεια να ζητήσω κι ο λοχαγός μου φώναξε «στραβάδι γύρνα πίσω»",
  ];

  const haf_logo = directoryPath + "assets/images/air.png";
  const army_logo = directoryPath + "assets/images/seal.png";
  const navy_logo = directoryPath + "assets/images/navy.png";

  $("#xmlupload").change(function () {
    $("#infobtn").click(function () {
      $("#info").show();
      $("#stats").hide();
    });
    $("#statsbtn").click(function () {
      $("#info").hide();
      $("#stats").css("display", "flex");
    });
    $("#infobtn").click();
    $("#closebtn").click(function () {
      window.location.reload();
    });
    var file = document.getElementById("xmlupload").files[0];
    if (file.type != "text/xml") {
      this.value = "";
      const Toast = Swal.mixin({
        toast: true,
        position: "top-end",
        showConfirmButton: false,
        timer: 3000,
        timerProgressBar: true,
        didOpen: (toast) => {
          toast.addEventListener("mouseenter", Swal.stopTimer);
          toast.addEventListener("mouseleave", Swal.resumeTimer);
        },
      });

      Toast.fire({
        icon: "error",
        title: "Please use only valid xml",
      });
      return;
    }

    const randomQuote = quotes[Math.floor(Math.random() * quotes.length)];
    document.getElementById("quote").innerHTML = randomQuote;

    const dashboard = document.getElementById("dashboard");
    const uploadform = document.getElementById("uploadform");

    fadeOutElement(uploadform);
    fadeInElement(dashboard);

    setTimeout(function () {
      var reader = new FileReader();
      reader.readAsText(file);
      reader.onloadend = function () {
        var xmlData = $(reader.result);
        xmlData = xmlData[1];
        const ypiresies = xmlData.getElementsByTagName("ipiresia");
        const details = xmlData.getElementsByTagName("stoixeia");
        const adeies = xmlData.getElementsByTagName("adeia");
        const poreia = xmlData.getElementsByTagName("poreia");
        let simioseis = xmlData.getElementsByTagName("simioseis");

        let personDetails = Array.from(details);
        personDetails = personDetails[0];
        const arrayServices = Array.from(ypiresies);
        const arrayAdeies = Array.from(adeies);
        const poreies = Array.from(poreia);
        simioseis = simioseis[0].childNodes;
        let asm = simioseis[5].innerText;
        if (asm.length == 0 || !asm.includes("/")) {
          asm = "Δεν υπάρχει αποθηκευμένος ορθός στρατιωτικός αριθμός";
        }

        const countYp = arrayServices.length;
        const countAdeies = arrayAdeies.length;

        const personName = personDetails.childNodes[0].innerText;
        const startYear = personDetails.childNodes[1].innerText;
        const startMonth = personDetails.childNodes[2].innerText;
        const startDay = personDetails.childNodes[3].innerText;
        const endYear = personDetails.childNodes[4].innerText;
        const endMonth = personDetails.childNodes[5].innerText;
        const endDay = personDetails.childNodes[6].innerText;
        let soma = personDetails.childNodes[7].innerText;

        let logo;
        let somaColor;
        let vathmoi;
        let textcolor;
        // ARMY = 0; NAVY = 1; HAF = 2;
        switch (soma) {
          case "0":
            soma = "Στρατός Ξηράς";
            logo = army_logo;
            somaColor = "#fde81a";
            vathmoi = landVathmoi;
            textcolor = "#585759";
            break;
          case "1":
            soma = "Πολεμικό Ναυτικό";
            logo = navy_logo;
            somaColor = "#1b4279";
            textcolor = "#fff";
            vathmoi = seaVathmoi;
            break;
          case "2":
            soma = "Πολεμική Αεροπορία";
            logo = haf_logo;
            somaColor = "#008bd0";
            vathmoi = airVathmoi;
            textcolor = "#fff";
            break;
          default:
            break;
        }

        const oplo_stratou = personDetails.childNodes[8].innerText; // It returns value only on ξηρά..
        const seira = personDetails.childNodes[9].innerText;
        const esso = personDetails.childNodes[10].innerText;
        const prison = personDetails.childNodes[11].innerText;
        const notLetMeOut = personDetails.childNodes[12].innerText;

        const startDate = formatDateString(startDay, startMonth, startYear);
        const endDate = formatDateString(endDay, endMonth, endYear);
        const todayDateString = todayDate();

        document.getElementById("start").innerHTML = startDate;
        document.getElementById("end").innerHTML = endDate;

        let apolele = findDifferenceOfDays(endDate, todayDateString); // How many days for leaving army and be citizen again.
        apolele = apolele - 1; // including ΚΣ

        const todayForCheck = new Date();
        const startForCheck = new Date(dateFormat(startDate));
        const endForCheck = new Date(dateFormat(endDate));
        const monthsInArmy = getMonths(startForCheck, endForCheck);

        let daysInArmy = findDifferenceOfDays(todayDateString, startDate); // How many days in army
        const totalDays = findDifferenceOfDays(endDate,startDate);

        if (totalDays < daysInArmy){
          //Stop counter when citizen
          daysInArmy = totalDays;
        }

        const thiteia = findDifferenceOfDays(endDate, startDate);
        let p = percentage(daysInArmy, thiteia);
        p = p.toFixed(2);

        let countVathmoi = vathmoi.length;
        const changeVathmoAt = parseInt(thiteia / countVathmoi);
        const vathmosPosition = Math.abs(~~(daysInArmy / changeVathmoAt));
        const vathmos = vathmoi[vathmosPosition];
        let vathmosText;
        if (vathmos) {
          vathmosText = vathmos;
          document
            .getElementById("vathmosimg")
            .setAttribute(
              "src",
              directoryPath + "assets/images/vathmoi/" + vathmos + ".png"
            );
        } else {
          vathmosText = "ΠΡΟΣΕΧΩΣ ΠΟΛΙΤΗΣ";
        }

        if (isAfter(todayForCheck, endForCheck)) {
          apolele = 0;
          p = 100;
          vathmosText = "ΠΟΛΙΤΗΣ";
        }

        document.getElementById("vathmos").innerHTML = vathmosText;

        const htmlPercentage = `<div class="progress-bar progress-bar-striped progress-bar-animated" role="progressbar" aria-valuenow="${p}" aria-valuemin="0" aria-valuemax="100" style="width:${p}%"></div>`;
        $("#pr").append(htmlPercentage);
        document.getElementById("the-percentage").innerText = ` ${p}%`;
        document.querySelector(".progress-bar").style.backgroundColor =
          somaColor;
        $(".box").css("background-color", somaColor);
        $(".box").css("color", textcolor);
        $(".box-number").css("color", textcolor);
        $(".dashbtn i").css("color", textcolor);
        $(".dashbtn").css("background-color", somaColor);

        let yp_names = [];
        let adeies_names = [];
        const ypDays = [];

        let j = 1;
        arrayServices.forEach((element) => {
          let yp_name = element.childNodes[0].innerText;
          let yp_year = element.childNodes[1].innerText;
          let yp_month = element.childNodes[2].innerText;
          let yp_day = element.childNodes[3].innerText;
          let number = element.childNodes[4].innerText;
          yp_month = fixMonth(yp_month);
          let ypString = `${yp_day}/${yp_month}/${yp_year}`;
          ypDays.push(ypString);

          let html_yp = `
      <tr>
        <th scope="row">${j}</th>
        <td>${yp_name}</td>
        <td>${ypString}</td>
        <td>${number}</td>
      </tr>`;
          $(".tbody-yp").append(html_yp);
          j++;
          yp_names.push(yp_name);
        });

        monthsInArmy.forEach((element) => {
          let counterByMonth = 0;
          const year = element.year;
          const month = element.month;
          arrayServices.forEach((element) => {
            let yp_year = element.childNodes[1].innerText;
            let yp_month = element.childNodes[2].innerText;
            yp_month = fixMonth(yp_month);
            if (year == yp_year && month == yp_month) {
              counterByMonth++;
            }
          });
          element.counter = counterByMonth;
          element.date = `${month}/${year}`;
        });

        am5.ready(function () {
          // Create root element
          // https://www.amcharts.com/docs/v5/getting-started/#Root_element
          var root = am5.Root.new("barchartdiv");

          // Set themes
          // https://www.amcharts.com/docs/v5/concepts/themes/
          root.setThemes([am5themes_Animated.new(root)]);

          // Create chart
          // https://www.amcharts.com/docs/v5/charts/xy-chart/
          var chart = root.container.children.push(
            am5xy.XYChart.new(root, {
              panX: false,
              panY: false,
              wheelX: false,
              wheelY: false,
              pinchZoomX: true,
            })
          );

          // Add cursor
          // https://www.amcharts.com/docs/v5/charts/xy-chart/cursor/
          var cursor = chart.set("cursor", am5xy.XYCursor.new(root, {}));
          cursor.lineY.set("visible", false);

          // Create axes
          // https://www.amcharts.com/docs/v5/charts/xy-chart/axes/
          var xRenderer = am5xy.AxisRendererX.new(root, {
            minGridDistance: 30,
          });
          xRenderer.labels.template.setAll({
            rotation: -90,
            centerY: am5.p50,
            centerX: am5.p100,
            paddingRight: 15,
          });

          var xAxis = chart.xAxes.push(
            am5xy.CategoryAxis.new(root, {
              maxDeviation: 0.3,
              categoryField: "date",
              renderer: xRenderer,
              tooltip: am5.Tooltip.new(root, {}),
            })
          );

          var yAxis = chart.yAxes.push(
            am5xy.ValueAxis.new(root, {
              maxDeviation: 0.3,
              renderer: am5xy.AxisRendererY.new(root, {}),
            })
          );

          // Create series
          // https://www.amcharts.com/docs/v5/charts/xy-chart/series/
          var series = chart.series.push(
            am5xy.ColumnSeries.new(root, {
              name: "Series 1",
              xAxis: xAxis,
              yAxis: yAxis,
              valueYField: "counter",
              sequencedInterpolation: true,
              categoryXField: "date",
              tooltip: am5.Tooltip.new(root, {
                labelText: "{valueY}",
              }),
            })
          );

          series.columns.template.setAll({
            cornerRadiusTL: 5,
            cornerRadiusTR: 5,
          });
          series.columns.template.adapters.add("fill", function (fill, target) {
            return chart.get("colors").getIndex(series.columns.indexOf(target));
          });

          series.columns.template.adapters.add(
            "stroke",
            function (stroke, target) {
              return chart
                .get("colors")
                .getIndex(series.columns.indexOf(target));
            }
          );

          xAxis.data.setAll(monthsInArmy);
          series.data.setAll(monthsInArmy);

          // Make stuff animate on load
          // https://www.amcharts.com/docs/v5/concepts/animations/
          series.appear(1000);
          chart.appear(1000, 100);
        }); // end am5.ready()

        const daysInArmyWithoutOut = daysInArmy - countAdeies;

        let serviceCount;
        let sCount = [];
        yp_names.forEach((element) => {
          serviceCount = countItemsInArray(yp_names, element);
          let jsonObj = {
            name: element,
            counter: serviceCount,
            color: randomColor(),
          };
          sCount.push(jsonObj);
        });

        let uniqueServices = uniqueByKey(sCount, "counter");

        toDatatables("#tservices");

        let i = 1;
        arrayAdeies.forEach((element) => {
          let adeiaName = element.childNodes[0].innerText;
          let adeiaYear = element.childNodes[1].innerText;
          let adeiaMonth = element.childNodes[2].innerText;
          let adeiaDay = element.childNodes[3].innerText;
          adeiaMonth = fixMonth(adeiaMonth);
          let adeiaString = `${adeiaDay}/${adeiaMonth}/${adeiaYear}`;
          let html_adeies = `
      <tr>
        <th scope="row">${i}</th>
        <td>${adeiaName}</td>
        <td>${adeiaString}</td>
      </tr>`;
          $(".tbody-adeies").append(html_adeies);
          i++;
          adeies_names.push(adeiaName);
        });

        let adeiesCount;
        let aCount = [];
        adeies_names.forEach((element) => {
          adeiesCount = countItemsInArray(adeies_names, element);
          let jsonObj = {
            name: element,
            counter: adeiesCount,
            color: randomColor(),
          };
          aCount.push(jsonObj);
        });

        const thiteiaData = [
          { name: "Αδειες", counter: arrayAdeies.length, color: randomColor() },
          {
            name: "Υπηρετήθηκαν",
            counter: daysInArmyWithoutOut,
            color: randomColor(),
          },
          { name: "Απομένουν", counter: apolele, color: randomColor() },
        ];

        let uniqueAdeies = uniqueByKey(aCount, "counter");

        toDatatables("#tadeies");

        if (poreies.length < 1) {
          $("#event").hide();
        }

        poreies.forEach((element) => {
          let poreiaName = element.childNodes[0].innerText;
          let poreiaYear = element.childNodes[1].innerText;
          let poreiaMonth = element.childNodes[2].innerText;
          poreiaMonth = parseInt(poreiaMonth) + 1;
          let poreiaDay = element.childNodes[3].innerText;
          const poreiaDate = `${poreiaDay}/${poreiaMonth}/${poreiaYear}`;
          const poreiaHtml = `<div class="d-flex gap-3">
        <p class="eventdate">${poreiaDate}</p>
        <p class="eventname">${poreiaName}</p>
        </div>`;
          $("#event").append(poreiaHtml);
        });

        $(".eventdate").css("color", textcolor);
        $(".eventdate").css("background-color", somaColor);

        const mfYpiresia = maxElement(yp_names);
        const mfAdeia = maxElement(adeies_names);

        document.getElementById("person-name").innerText = personName;
        document.getElementById(
          "esso-seira"
        ).innerText = `${esso} ΕΣΣΟ/${startYear} - Σειρά:${seira}`;
        document.getElementById("asm").innerText = asm;
        document.getElementById("soma").innerText = soma;
        document.getElementById("somaimg").src = logo;
        document.getElementById("done").setAttribute("num", daysInArmy);
        document.getElementById("todo").setAttribute("num", apolele);
        document.getElementById("services").setAttribute("num", countYp);
        document.getElementById("adeies").setAttribute("num", countAdeies);
        document.getElementById("sex").setAttribute("num", notLetMeOut);
        document.getElementById("jail").setAttribute("num", prison);
        document.getElementById("adeia-text").innerText = mfAdeia;
        if (countYp > 0) {
          document.getElementById("service-text").innerText = mfYpiresia;
        } else {
          document.getElementById("service-text").innerText =
            "Δεν έχουν οριστεί υπηρεσίες";
        }

        if (countAdeies > 0) {
          document.getElementById("adeia-text").innerText = mfAdeia;
        } else {
          document.getElementById("adeia-text").innerText =
            "Δεν έχουν οριστεί αδειες";
        }

        const counters = document.querySelectorAll(".box-number");
        const speed = 800;

        counters.forEach((counter) => {
          const animate = () => {
            const value = +counter.getAttribute("num");
            const data = +counter.innerText;

            const time = value / speed;
            if (data < value) {
              counter.innerText = Math.ceil(data + time);
              setTimeout(animate, 1);
            } else {
              counter.innerText = value;
            }
          };
          animate();
        });

        if (countYp > 0) {
          pieChart("service-pie", "counter", "name", uniqueServices);
          $(".servicepie").css("display", "block");
          $("#bar").css("display", "block");
        } else {
          $("#stats").append(
            '<p class="text-center">Δεν έχουν οριστεί υπηρεσίες</p>'
          );
        }
        if (countAdeies > 0) {
          pieChart("adeies_pie", "counter", "name", uniqueAdeies);
          pieChart("thiteia-pie", "counter", "name", thiteiaData);
          $(".adeiespie").css("display", "block");
          $(".thiteiapie").css("display", "block");
        } else {
          $("#stats").append(
            '<p class="text-center">Δεν έχουν οριστεί αδειες</p>'
          );
        }
      };
    }, 180);
  });
  $(".steps").slick({
    infinite: true,
    autoplay: true,
    autoplaySpeed: 4000,
    slidesToShow: 1,
    slidesToScroll: 1,
    dots: true,
    arrows: false,
  });
});
